<?php
/**
 * =====================================================================================
 *
 *        Filename: 累加到Aim.php
 *
 *     Description: 汉诺塔就是，三根柱子， 第一根上放着从上到下，从小到大的盘子， 需要把第一根上的所有盘子，借助第二根移动到第三根上（大小顺序
 *                  不变）。且每次只能移动一个盘子，且必须保证每根柱子上都是大在下，小在上的原则摆放。
 *
 *         Created: 2020-02-18 22:22:51
 *
 *          Author: huazhiqiang
 *
 * =====================================================================================
 *
 */

function Aim($arr, $aim){

}

$bullNumber = Bull3(6);
printf("母牛的总个数%d\n", $bullNumber);